# -*- coding: utf-8 -*-
NEW_USER_WELCOME = u"""Привет, я Джинн Ярушки.

Я помогу тебе быстро узнавать о постах твоих друзей, и мгновенно комментировать их, даже не открывая браузер.
Для начала, дай мне доступ к своей Ярушечке.

Для этого, пройди по URL:
https://oauth.yandex.ru/authorize?client_id=911aec2bd1f543e194d68bd916f2190c&response_type=code&state=%s

Если будут затруднения, напиши мне "помощь" или "help".
"""

OLD_USER_WELCOME = u"""Добро пожаловать, хозяин.

Если захочешь освежить память, напиши мне "помощь" или "help".
"""

END_REGISTRATION = u"""Поздравляю, регистрация окончена!"""

HELP = u"""Я Джинн Ярушки, у тебя есть три желания...
...да ладно, шучу, шучу. Вот список команд, которые я понимаю:

[help|помощь|справка] — вывести эту подсказку.
#<хэш> — прокомментировать сообщение во френдленте. <хэш>, это идентификатор сообщения.
"""

REQUIRE_AUTH_TOKEN = u"""Сначала, дай мне доступ к своей Ярушечке.

Для этого, пройди по URL:
https://oauth.yandex.ru/authorize?client_id=911aec2bd1f543e194d68bd916f2190c&response_type=code&state=%s
"""


